package com.kosmo.ex;

public class S01ClassAndPackage {
    /*
## ✅ \[개념 문제] 자바 컴파일과 실행 순서

---

### 📘 문제 1. 다음 중 자바 소스 코드가 실행되기까지의 **올바른 순서**를 고르세요. C 번
A. 실행 → 컴파일 → 클래스 파일 생성 → 결과 출력
B. 클래스 파일 생성 → 컴파일 → 실행 → 결과 출력
C. 소스 코드 작성 → 컴파일 → 클래스 파일 생성 → 실행 → 결과 출력
D. 소스 코드 작성 → 실행 → 클래스 파일 생성 → 결과 출력


### 📘 문제 2. 자바 파일을 컴파일할 때 사용하는 명령어는 무엇인가요?

(주관식 Javac

### 📘 문제 3. 자바 프로그램을 실행할 때 사용하는 명령어는 무엇인가요?

(주관식) Java

### 📘 문제 4. 다음 중 자바의 `.java` 파일을 컴파일하면 생성되는 파일의 확장자는 무엇인가요? B번
(객관식)

A. `.txt`
B. `.class`
C. `.exe`
D. `.jar`

### 📘 문제 5. L01Hello.java 자바 프로그램을 터미널에서 실행하는 순서를 나열해보세요.

(서술형) 소스파일 , 터미널에서 폴더 이동, 컴파일, 실행

---

### 📘 문제 6. 다음 설명 중 맞지 않는 것은? C 번

(객관식)

A. `.java` 파일은 사람이 읽을 수 있는 코드이다.
B. `javac` 명령어는 자바 코드를 클래스 파일로 바꾼다.
C. `.class` 파일은 자바 컴파일러가 실행하는 파일이다.
D. JVM은 `.class` 파일을 읽어 실행한다.




---
### 📘 문제 7. 다음 중 JDK(Java Development Kit)의 구성요소가 아닌 것은? C번
(객관식)
A. 컴파일러 (javac)
B. 실행 엔진 (JRE)
C. 자바 언어로 만든 게임
D. 기본 패키지와 라이브러리

### 📘 문제 8. JRE(Java Runtime Environment)에 대한 설명으로 알맞은 것은? B번
(객관식)
A. 자바 코드를 컴파일하는 도구이다.
B. 자바 코드를 실행하는 환경이다.
C. 자바 코드를 작성하는 IDE이다.
D. 외부 라이브러리를 설치하는 도구이다.

### 📘 문제 9. 패키지를 사용하는 주된 목적은 무엇인가요?
(서술형)클레스를 유일하게 만드는 패키징

### 📘 문제 10. 아래 코드에서 `Math.pow(2, 10)`은 어떤 의미인가요? B번
(객관식)
A. 2를 10으로 나눈다
B. 2의 10제곱을 계산한다
C. 10의 2제곱을 계산한다
D. 오류가 발생한다

### 📘 문제 11. `java.lang` 패키지의 특징으로 옳은 것은? A,B

(객관식, 복수 정답 가능)
A. 자동으로 import된다
B. System, Math 등의 클래스가 포함되어 있다
C. 사용하려면 반드시 import 문을 써야 한다
D. 자바 실행과 관련된 필수 기능을 포함한다

### 📘 문제 12. 다음 중 모두 클래스 이름인 것은? A,B
(객관식)

A. Math
B. System
C. pow
D. String

### 📘 문제 13. 아래 코드의 실행 결과를 예측하세요. 9
(코드 이해 문제)
public class Test {
    public static void main(String[] args) {
        System.out.println(Math.pow(3, 2));
    }
}

### 📘 문제 14. 클레스가 충돌하는 경우, 자바에서는 어떻게 구분할 수 있나요?
(서술형)
클래스 앞에 패키지명을 사용
s.com.Math
java.lang.Math

### 📘 문제 15. 다음 중 자바의 기본 제공 패키지로 자동 import되는 것은? C번

(객관식)
A. java.util
B. java.io
C. java.lang
D. java.net

    *
    * */
}